In [34]:
import pandas as pd
import numpy as np

In [55]:
df1 = pd.read_csv("data/M+ Software Airflow Assignment - STT1.csv")
df2 = pd.read_csv("data/M+ Software Airflow Assignment - STT2.csv")

In [79]:
df = pd.concat([df1, df2]).drop_duplicates(subset=['number'], keep='last').reset_index(drop=True)
df["debit"] = np.where(df['client_type'] == 'C', df['amount'], np.nan)
df["credit"] = np.where(df['client_type'] == 'V', df['amount'], np.nan)
df.head()

,number,date,client_code,amount,client_type,debit,credit
0,11MS1756734386179,2025-11-01,MS24068,92386.0,C,92386.0,NaN
1,11MS1756806734875,2025-11-03,MS10001,33483.0,C,33483.0,NaN
2,11MS1756805078379,2025-11-01,MS90712,114925.0,V,NaN,114925.0
3,11MS1756805216425,2025-11-02,MS11708,180608.0,V,NaN,180608.0
4,11MS1756807446400,2025-11-03,MS11708,224073.0,V,NaN,224073.0

In [87]:
df_result = df.groupby(["date", "client_code"]).agg(
    stt_count = ("amount", "count"),
    debit = ("debit", "sum"),
    credit = ("credit", "sum")
).reset_index()

df_result.head()

         date client_code  stt_count     debit    credit
0  2025-11-01     MS10001          5  143601.0       0.0
1  2025-11-01     MS11708          5       0.0  874330.0
2  2025-11-01     MS23154          5       0.0  808255.0
3  2025-11-01     MS24068          5  388784.0       0.0
4  2025-11-01     MS37568          5  196533.0       0.0